**Topic**
- Dropping Columns
- Dropping Rows
- Various Parameter in Dropping functionalities
- Handling Missing values by Mean

In [2]:
from pyspark.sql import SparkSession
spark=SparkSession.builder.appName("Practice2").getOrCreate()
spark

In [27]:
df_test4=spark.read.csv('test4.csv',header=True,inferSchema=True)
df_test4.show()

+---------+----+----------+------+
|     Name| Age|Experience|Salary|
+---------+----+----------+------+
|   Shayan|  31|        10| 30000|
|  Pranjit|  30|         8| 25000|
|   Samrat|  29|         4| 20000|
|  Diptanu|  24|         3| 20000|
|Dwiprahar|  21|         1| 15000|
|   Tanmoy|null|         2| 18000|
|    Rohan|null|      null| 40000|
|     null|  34|        10| 38000|
|     null|  36|      null|  null|
+---------+----+----------+------+

In [28]:
# drop columns
df_test4.drop('Name').show()

+----+----------+------+
| Age|Experience|Salary|
+----+----------+------+
|  31|        10| 30000|
|  30|         8| 25000|
|  29|         4| 20000|
|  24|         3| 20000|
|  21|         1| 15000|
|null|         2| 18000|
|null|      null| 40000|
|  34|        10| 38000|
|  36|      null|  null|
+----+----------+------+

In [29]:
# droping rows
df_test4.na.drop().show()

+---------+---+----------+------+
|     Name|Age|Experience|Salary|
+---------+---+----------+------+
|   Shayan| 31|        10| 30000|
|  Pranjit| 30|         8| 25000|
|   Samrat| 29|         4| 20000|
|  Diptanu| 24|         3| 20000|
|Dwiprahar| 21|         1| 15000|
+---------+---+----------+------+

In [30]:
# drop with 'how'
# how='any'
df_test4.na.drop(how='any').show()

+---------+---+----------+------+
|     Name|Age|Experience|Salary|
+---------+---+----------+------+
|   Shayan| 31|        10| 30000|
|  Pranjit| 30|         8| 25000|
|   Samrat| 29|         4| 20000|
|  Diptanu| 24|         3| 20000|
|Dwiprahar| 21|         1| 15000|
+---------+---+----------+------+

In [31]:
# how='all'
df_test4.na.drop(how='all').show()

+---------+----+----------+------+
|     Name| Age|Experience|Salary|
+---------+----+----------+------+
|   Shayan|  31|        10| 30000|
|  Pranjit|  30|         8| 25000|
|   Samrat|  29|         4| 20000|
|  Diptanu|  24|         3| 20000|
|Dwiprahar|  21|         1| 15000|
|   Tanmoy|null|         2| 18000|
|    Rohan|null|      null| 40000|
|     null|  34|        10| 38000|
|     null|  36|      null|  null|
+---------+----+----------+------+

In [32]:
# drop with thresold
df_test4.na.drop(how='any',thresh=2).show() # thresold number specifies minimum non-null value numbers

+---------+----+----------+------+
|     Name| Age|Experience|Salary|
+---------+----+----------+------+
|   Shayan|  31|        10| 30000|
|  Pranjit|  30|         8| 25000|
|   Samrat|  29|         4| 20000|
|  Diptanu|  24|         3| 20000|
|Dwiprahar|  21|         1| 15000|
|   Tanmoy|null|         2| 18000|
|    Rohan|null|      null| 40000|
|     null|  34|        10| 38000|
+---------+----+----------+------+

In [33]:
# subset
df_test4.na.drop(how='any',subset=['Name']).show()

+---------+----+----------+------+
|     Name| Age|Experience|Salary|
+---------+----+----------+------+
|   Shayan|  31|        10| 30000|
|  Pranjit|  30|         8| 25000|
|   Samrat|  29|         4| 20000|
|  Diptanu|  24|         3| 20000|
|Dwiprahar|  21|         1| 15000|
|   Tanmoy|null|         2| 18000|
|    Rohan|null|      null| 40000|
+---------+----+----------+------+

In [34]:
# Filling missing values
df_test4.na.fill("Missing Value",['Experience','Age']).show()

+---------+----+----------+------+
|     Name| Age|Experience|Salary|
+---------+----+----------+------+
|   Shayan|  31|        10| 30000|
|  Pranjit|  30|         8| 25000|
|   Samrat|  29|         4| 20000|
|  Diptanu|  24|         3| 20000|
|Dwiprahar|  21|         1| 15000|
|   Tanmoy|null|         2| 18000|
|    Rohan|null|      null| 40000|
|     null|  34|        10| 38000|
|     null|  36|      null|  null|
+---------+----+----------+------+

In [37]:
# imputer function - Machine Learning

from pyspark.ml.feature import Imputer

imputer=Imputer(
    inputCols=['Age','Experience','Salary'],
    outputCols=["{}_imputed".format(c) for c in ['Age','Experience','Salary']]
).setStrategy('median') # we can also pass 'mean'

In [38]:
# applying imputer in dataframe

imputer.fit(df_test4).transform(df_test4).show()

+---------+----+----------+------+-----------+------------------+--------------+
|     Name| Age|Experience|Salary|Age_imputed|Experience_imputed|Salary_imputed|
+---------+----+----------+------+-----------+------------------+--------------+
|   Shayan|  31|        10| 30000|         31|                10|         30000|
|  Pranjit|  30|         8| 25000|         30|                 8|         25000|
|   Samrat|  29|         4| 20000|         29|                 4|         20000|
|  Diptanu|  24|         3| 20000|         24|                 3|         20000|
|Dwiprahar|  21|         1| 15000|         21|                 1|         15000|
|   Tanmoy|null|         2| 18000|         30|                 2|         18000|
|    Rohan|null|      null| 40000|         30|                 4|         40000|
|     null|  34|        10| 38000|         34|                10|         38000|
|     null|  36|      null|  null|         36|                 4|         20000|
+---------+----+----------+------+-----------+------------------+--------------+